-- 1.ALLEN과 부서가 같은 사원들의 사원명, 입사일을 출력하되 높은 급여순으로 출력하세요.

-- 2.가장 높은 급여를 받는 사원보다 입사일이 늦은 사원의 이름, 입사일을 출력하세요.

-- 3.FORD 보다 입사일이 늦은 사원 중 급여가 가장 높은 사원의 이름과 급여를 출력하세요.

-- 4.이름에 "T"자가 들어가는 사원들의 급여의 합을 구하세요.

-- 5.이름에 "S" 자가 들어가는 사원들 중 급여가 가장 높은 사원의 이름,급여를 출력하세요.

-- 6.모든 사원의 평균급여를 구하세요.

-- 7. 20번 부서의 최고 급여보다 많은 사원의 사원번호,사원명,급여를 출력하세요.

-- 8. SALES(영업부) 부서에서 근무하는 모든 사원의 이름과 급여를 출력하시오.

-- 9.직속상관이 KING인 사원의 이름과 급여를 출력하시오. 

-- 10.상반기(1월~ 6월) 입사한 사원의 이름 과 입사일을 구하시요.

-- 11. 홀수 년도에 입사한 사원의 이름 과 입사일을 구하시요.

-- --------------------births. sql 을 이용한 문제
-- 12. 2000년대 이후 출생한 남아수, 여아수를 출력하시요

-- 13.  2000년대 이후 출생한 남아수, 여아수, 남아율(%) 을 출력하시요		

-- 14. 남아수가 가장많은 년도, 남아수를 구하시요.

-- 15. 2000 년대이후 남아수가 50000 이상이면 '많음' '적음' 으로 정도 컬럼을 표시하시요
